### Dataframe initialisation:

https://likegeeks.com/create-pandas-dataframe/

In [31]:
import pandas as pd
import numpy as np

Most useful, from dictionary:

In [ ]:
df = pd.DataFrame({'Name': ['Tom', 'nick', 'krish', 'jack'],
                    'Age': [20, 21, 19, 18]},
                    index=['rank1', 'rank2', 'rank3', 'rank4'])

df

        Name  Age
rank1    Tom   20
rank2   nick   21
rank3  krish   19
rank4   jack   18

List and list of lists:

In [3]:
df = pd.DataFrame(data = [1,2,3,4], columns=['Numbers'])
df

   Numbers
0        1
1        2
2        3
3        4

In [7]:
df = pd.DataFrame([['tom', 10], ['nick', 15], ['juli', 14]], columns=['Name', 'Age'])
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

From **Series** objects:

In [27]:
a = pd.Series([1, 3, 5, 6, 8])
b = pd.Series([2, 4, 6, 8, 10])

Note series added row wise rather than column wise.

In [28]:
df = pd.DataFrame([a,b])
df

   0  1  2  3   4
0  1  3  5  6   8
1  2  4  6  8  10

Can be fixed by transposing the dataframe:

In [29]:
df.T

   0   1
0  1   2
1  3   4
2  5   6
3  6   8
4  8  10

Or naming columns; either in declaration of series or df object.

In [25]:
df = pd.DataFrame({'a': a, 'b': b})
df

   a   b
0  1   2
1  3   4
2  5   6
3  6   8
4  8  10

Especially useful when combining many series into 1 dataframe. Note the effect of axis. Concat may be redundant if can just use list as above.

In [22]:
df = pd.DataFrame(pd.concat([a, b], axis=0))
df

    0
0   1
1   3
2   5
3   6
4   8
0   2
1   4
2   6
3   8
4  10

In [23]:
df = pd.DataFrame(pd.concat([a, b], axis=1))
df

   0   1
0  1   2
1  3   4
2  5   6
3  6   8
4  8  10

Copy function can be used to modify df while preserving original data:

In [33]:
df2 = df.copy()
df2 += 1
df2

   0  1  2  3   4
0  2  4  6  7   9
1  3  5  7  9  11

In [34]:
df

   0  1  2  3   4
0  1  3  5  6   8
1  2  4  6  8  10

From text using regex:

In [36]:
import re

# sample text data
text = '''
Adam is 25 years old
Tom is 30 years old
Lisa is 35 years old
Dan is 40 years old
Eve is 45 years old
Frank is 50 years old
Grace is 55 years old
Heidi is 60 years old
Ivan is 65 years old
Judy is 70 years old
'''

# use regex to extract names and ages
names = re.findall(r'(\w+) is \d+ years old', text)
ages = re.findall(r'\w+ is (\d+) years old', text)

# create dataframe from the extracted data
df = pd.DataFrame({
    'Name': names,
    'Age': ages
})

In [37]:
df

    Name Age
0   Adam  25
1    Tom  30
2   Lisa  35
3    Dan  40
4    Eve  45
5  Frank  50
6  Grace  55
7  Heidi  60
8   Ivan  65
9   Judy  70